app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.all
---
SELECT * FROM `comentarios`

  def show
    @comentario = Comentario.find(params[:id])
---
SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)

  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save
---
INSERT INTO `comentarios` (`updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`, `created_at`) VALUES('2010-05-12 23:04:15', 'Restaurante muito ruim!', 'Restaurante', 1, '2010-05-12 23:04:15')

  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy
---
SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
DELETE FROM `comentarios` WHERE `id` = 1