app/controllers/restaurantes_controller.rb

	def index
		@restaurantes = Restaurante.paginate :page=>params['page'], :per_page=>3
---
SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`

	def show
		@restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)

	def create
		@restaurante = Restaurante.new(params[:restaurante])
		if @restaurante.save
---
INSERT INTO `restaurantes` (`updated_at`, `especialidade`, `endereco`, `nome`, `created_at`) VALUES('2010-05-11 01:45:31', 'A', 'E', 'Teste', '2010-05-11 01:45:31')

	def edit
		@restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)

	def update
		@restaurante = Restaurante.find(params[:id])
		if @restaurante.update_attributes(params[:restaurante])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 2)
UPDATE `restaurantes` SET `endereco` = 'a', `especialidade` = 'c', `updated_at` = '2010-05-11 01:44:56' WHERE `id` = 2

	def destroy
		@restaurante = Restaurante.find(params[:id])
		@restaurante.destroy
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)
DELETE FROM `restaurantes` WHERE `id` = 1

	def busca
		@restaurantes = Restaurante.find :all, :conditions=>"especialidade='#{params[:especialidade]}'"
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`especialidade` = 'italiano') LIMIT 1